Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The workaround is a bit more complex as besides sending the fruits coming from Kafka, we need to send pings periodically. To achieve this we merge the stream coming from Kafka and a periodic stream emitting `{}` every 10 seconds.
ja_jp: Kafka からの fruits を送信する以外に、定期的に ping を送信する必要があるため、回避策は少し複雑になっています。これを実現するために、Kafka からのストリームと、10 秒ごとに `{}` を放出する定期的なストリームをマージします。

source: The xref:cdi-integration.adoc[CDI integration guide] has more detail on common CDI-related integration use cases, and example code for solutions.
ja_jp: xref:cdi-integration.adoc[CDI インテグレーションガイド] には、一般的な CDI 関連のインテグレーションのユースケースとソリューションのサンプルコードの詳細が記載されています。

source: The xref:cdi-integration.adoc[CDI integration guide] has more detail on common CDI-related use cases, and example code for solutions.
ja_jp: xref:cdi-integration.adoc[CDI インテグレーションガイド] には、一般的な CDI 関連のユースケースとソリューションのサンプルコードの詳細が記載されています。

source: The xref:cdi-integration.adoc[CDI integration guide] presents solutions to a number of CDI-related use cases for extension authors.
ja_jp: xref:cdi-integration.adoc[CDI インテグレーションガイド] では、エクステンションの作成者向けに、さまざまな CDI 関連のユースケースに対するソリューションが提示されています。

source: The xref:context-propagation.adoc[MicroProfile Context Propagation] specification addresses this issue. It saves and restores the values stored in thread locals whenever we switch to another processing unit. However, that model is expensive. Context locals (also known as _duplicated context_) is another way to do this and requires fewer mechanics.
ja_jp: xref:context-propagation.adoc[MicroProfile Context Propagation] 仕様はこの問題に対応しています。 別の処理ユニットに切り替えるたびに、スレッドローカルに保存された値を保存して復元します。 しかし、このモデルは高価です。 コンテキスト・ローカル（ _重複コンテキスト_ とも呼ばれる）は、これを行う別の方法であり、必要な仕組みが少なくて済みます。

source: The xref:doc-concept.adoc[Quarkus documentation content types].
ja_jp: xref:doc-concept.adoc[Quarkus ドキュメントのコンテンツタイプ]。

source: The xref:doc-reference.adoc[Quarkus style and content guidelines] for the required syntax, preferred style, and other conventions.
ja_jp: 必要な構文、推奨されるスタイル、およびその他の規則については、xref:doc-reference.adoc[Quarkus のスタイルとコンテンツのガイドライン] を参照してください。

source: The xref:extension-metadata.adoc#quarkus-extension-yaml[quarkus-extension.yaml] file (in the extension's `runtime/` module) has the minimum metadata set:
ja_jp: xref:extension-metadata.adoc#quarkus-extension-yaml[quarkus-extension.yaml] ファイル（エクステンションの `runtime/` モジュール内）には、最小限のメタデータが設定されている:

source: The xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] extension facilitates the usage of Hibernate ORM by providing active record style entities (and repositories) and focuses on making your entities trivial and fun to write in Quarkus.
ja_jp: xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] エクステンションはアクティブレコードスタイルのエンティティ（およびリポジトリ）を提供してHibernate ORMを簡単に使えるようにし、Quarkusでエンティティを簡単に楽しく書けるようにすることに重点を置いています。

source: The xref:hibernate-orm.adoc#multitenancy[Hibernate Multitenancy] is supported, and you can store the user entity in a persistence unit with enabled multitenancy. However, if your `io.quarkus.hibernate.orm.runtime.tenant.TenantResolver` must access the `io.vertx.ext.web.RoutingContext` to resolve request details, you must disable proactive authentication. For more information about proactive authentication, see the Quarkus xref:security-proactive-authentication.adoc[Proactive authentication] guide.
ja_jp: xref:hibernate-orm.adoc#multitenancy[Hibernate マルチテナンシー] がサポートされているので、マルチテナンシーを有効にした永続ユニットにユーザー・エンティティを格納できます。 ただし、 `io.quarkus.hibernate.orm.runtime.tenant.TenantResolver` 、 `io.vertx.ext.web.RoutingContext` にアクセスしてリクエストの詳細を解決する必要がある場合は、プロアクティブ認証を無効にする必要があります。プロアクティブ認証の詳細については、Quarkus xref:security-proactive-authentication.adoc[プロアクティブ認証] ガイドを参照してください。

source: The xref:hibernate-reactive-panache.adoc[Hibernate Reactive with Panache] extension facilitates the usage of Hibernate Reactive by providing active record style entities (and repositories) and focuses on making your entities trivial and fun to write in Quarkus.
ja_jp: link:hibernate-reactive-panache.html[Hibernate Reactive with Panache]エクステンションは、Active Recordスタイルのエンティティ（およびリポジトリ）を提供することで、Hibernate Reactiveの使用を促進し、Quarkusでエンティティを簡単に楽しく書けるようにすることに重点を置いています。

source: The xref:jfr.adoc[`quarkus-jfr`] extension can generate observability related events.
ja_jp: xref:jfr.adoc[`quarkus-jfr`] エクステンションは、オブザーバビリティー関連のイベントを生成できます。

source: The xref:liquibase-mongodb.adoc[Liquibase MongoDB] extension facilitates the initialization of a MongoDB database including indices and initial data. It implements the same schema migration facilities that Liquibase offers for SQL databases.
ja_jp: xref:liquibase-mongodb.adoc[Liquibase MongoDB] エクステンションは、インデックスと初期データを含む MongoDB データベースの初期化を容易にします。 Liquibase が SQL データベースに提供するものと同じスキーママイグレーション機能を実装しています。

source: The xref:mongodb-panache.adoc[MongoDB with Panache] extension facilitates the usage of MongoDB by providing active record style entities (and repositories) like you have in xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] and focuses on making your entities trivial and fun to write in Quarkus.
ja_jp: xref:mongodb-panache.adoc[MongoDB with Panache]エクステンションは、 xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] にあるようなアクティブレコードスタイルのエンティティ（およびリポジトリ）を提供することで、MongoDBの利用を促進し、Quarkusでエンティティを簡単に楽しく書けるようにすることに重点を置いています。

source: The xref:observability-devservices-lgtm.adoc[Grafana LGTM Dev Service] extension is available to visualize the telemetry data for logs, metrics and traces in Grafana.
ja_jp: xref:observability-devservices-lgtm.adoc[Grafana LGTM Dev Service] エクステンションを使用すると、Grafana のログ、メトリクス、トレースのテレメトリーデータを視覚化できます。

source: The xref:opentelemetry.adoc[OpenTelemetry Guide] is available with signal independent information about the OpenTelemetry extension.
ja_jp: xref:opentelemetry.adoc[OpenTelemetry ガイド] には、信号に依存しない、OpenTelemetry エクステンションに関する情報が記載されています。

source: The xref:opentelemetry.adoc[OpenTelemetry Guide] provides information about the OpenTelemetry extension.
ja_jp: xref:opentelemetry.adoc[OpenTelemetry ガイド] には、OpenTelemetry エクステンションに関する情報が記載されています。

source: The xref:registry.quarkus.io[registry.quarkus.io] is the default Quarkus community extension registry, but it is not meant to be always the only registry. Other organizations may find it useful to create their own Quarkus extension registries to provide their own xref:platform.adoc[Quarkus platforms] and/or individual (non-platform) Quarkus extensions. Users wishing to enable custom Quarkus extension registries in their environment would need to add them to the registry client configuration file.
ja_jp: xref:registry.quarkus.io[registry.quarkus.io] はデフォルトのQuarkusコミュニティエクステンションレジストリですが、常に唯一のレジストリであることを意図しているわけではありません。他の組織では、独自のQuarkusエクステンションレジストリを作成して、独自の xref:platform.adoc[Quarkusプラットフォーム] や個別の（プラットフォーム以外の）Quarkusエクステンションを提供することが便利な場合があります。自分の環境でカスタムのQuarkusエクステンションレジストリを有効にしたい場合は、レジストリのクライアント設定ファイルに追加する必要があります。

source: The xref:resteasy.adoc[RESTEasy] subresource locators declared as default interface methods cannot be secured by standard security annotations. Secured subresource locators must be implemented and secured on the interface implementors like in the example below:
ja_jp: デフォルトのインターフェイスメソッドとして宣言された xref:resteasy.adoc[RESTEasy] サブリソースロケーターは 標準のセキュリティーアノテーションでは保護できません 保護されたサブリソースロケーターは、次の例のように、インターフェイス実装者に実装され、保護される必要があります。

source: The xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication] expects that the bearer token is passed in the `Authorization` header during the initial HTTP handshake. Java WebSocket clients such as <<client-api, WebSockets Next Client>> and https://vertx.io/docs/vertx-core/java/#_websockets_on_the_client[Vert.x WebSocketClient] support adding custom headers to the WebSocket opening handshake. However, JavaScript clients that follow the https://websockets.spec.whatwg.org/#the-websocket-interface[WebSockets API] do not support adding custom headers. Therefore, passing a bearer access token using a custom `Authorization` header is impossible with JavaScript-based WebSocket clients. The JavaScript WebSocket client only allows to configure the HTTP https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-WebSocket-Protocol[Sec-WebSocket-Protocol] request header for negotiating a sub-protocol. If absolutely necessary, the `Sec-WebSocket-Protocol` header might be used as a carrier for custom headers, to provide a workaround the https://websockets.spec.whatwg.org/#the-websocket-interface[WebSockets API] restrictions. Here is an example of a JavaScript client propagating the `Authorization` header as a sub-protocol value:
ja_jp: xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラートークン認証] では、最初の HTTP ハンドシェイク中にベアラートークンが `Authorization` ヘッダーで渡されることを期待します。 <<client-api, WebSockets Next Client>> および https://vertx.io/docs/vertx-core/java/#_websockets_on_the_client[Vert.x WebSocketClient] などの Java WebSocket クライアントは、WebSocket オープニングハンドシェイクにカスタムヘッダーを追加することをサポートしています。 ただし、 https://websockets.spec.whatwg.org/#the-websocket-interface[WebSockets API] に準拠する JavaScript クライアントは、カスタムヘッダーの追加をサポートしていません。 したがって、JavaScript ベースの WebSocket クライアントでは、カスタム `Authorization` ヘッダーを使用してベアラーアクセストークンを渡すことはできません。 JavaScript WebSocket クライアントでは、サブプロトコルをネゴシエートするための HTTP https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-WebSocket-Protocol[Sec-WebSocket-Protocol] リクエストヘッダーのみを設定できます。 絶対に必要な場合は、 https://websockets.spec.whatwg.org/#the-websocket-interface[WebSockets API] の制限を回避するために、 `Sec-WebSocket-Protocol` ヘッダーをカスタムヘッダーのキャリアーとして使用できます。 以下は、 `Authorization` ヘッダーをサブプロトコル値として伝播する JavaScript クライアントの例です。

source: The xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication] mechanism has builtin support for the `SecurityIdentity` update. If you use other authentication mechanisms, you must implement the `io.quarkus.security.identity.IdentityProvider` provider that supports the `io.quarkus.websockets.next.runtime.spi.security.WebSocketIdentityUpdateRequest` authentication request.
ja_jp: xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラー認証] メカニズムには、`SecurityIdentity` の更新に対する組み込みサポートがあります。他の認証メカニズムを使用する場合は、`io.quarkus.websockets.next.runtime.spi.security.WebSocketIdentityUpdateRequest` 認証リクエストをサポートする `io.quarkus.security.identity.IdentityProvider` プロバイダーを実装する必要があります。

source: The xref:telemetry-micrometer-to-opentelemetry.adoc[quarkus-micrometer-opentelemetry] extension allows to use the Micrometer API and all existing automatic instrumentation available in Quarkus while sending all the telemetry with OpenTelemetry.
ja_jp: xref:telemetry-micrometer-to-opentelemetry.adoc[quarkus-micrometer-opentelemetry] エクステンションを使用すると、Quarkus で利用可能な Micrometer API と既存のすべての自動インスツルメンテーションを使用しながら、OpenTelemetry ですべてのテレメトリーを送信できます。

source: The xref:telemetry-micrometer-to-opentelemetry.adoc[quarkus-micrometer-opentelemetry] extension enables the use and export of Micrometer metrics via OpenTelemetry.
ja_jp: xref:telemetry-micrometer-to-opentelemetry.adoc[quarkus-micrometer-opentelemetry] エクステンションは、OpenTelemetry を介した Micrometer メトリクスの使用とエクスポートを可能にします。

source: The xref:telemetry-micrometer.adoc[Micrometer Guide] is available for detailed information about the Micrometer extension.
ja_jp: Micrometer エクステンションの詳細は、xref:telemetry-micrometer.adoc[Micrometer ガイド] を参照してください。

source: The xref:{doc-guides}/doc-reference.adoc[Quarkus documentation reference] for required syntax and other conventions.
ja_jp: xref:{doc-guides}/doc-reference.adoc[Quarkus ドキュメントリファレンス] で、必要な構文およびその他の規約を確認することができます。

source: The xref:{doc-guides}/doc-reference.adoc[Quarkus style and content guidelines] for the required syntax, preferred style, and other conventions.
ja_jp: 必要な構文やその他の規約のリファレンスとして xref:doc-reference.adoc[Quarkus スタイル・コンテンツガイドライン]

source: The {openshift} Docker build strategy is the preferred build strategy because it supports Quarkus applications targeted for JVM or compiled to native executables. However, for compatibility with earlier Quarkus versions, the default build strategy is S2I. To select the {openshift} Docker build strategy, use the `quarkus.openshift.build-strategy` property.
ja_jp: {openshift} を使用します。Dockerビルドストラテジーは、JVM向けのQuarkusアプリケーションやネイティブ実行ファイルにコンパイルされたQuarkusアプリケーションをサポートするため、推奨されるビルドストラテジーです。 ただし、以前のQuarkusバージョンとの互換性を保つため、デフォルトのビルドストラテジーはS2Iです。{openshift} を選択するにはDockerビルドストラテジーを選択するには、 `quarkus.openshift.build-strategy` プロパティを使用します。

source: The “adaptive” collection policy is based on HotSpot's ParallelGC adaptive size policy. The main difference with HotSpot is GraalVM's focus on memory footprint. This means that GraalVM’s adaptive GC policy tries to aggressively trigger GCs in order to keep memory consumption down.
ja_jp: “adaptive” コレクションポリシーは、HotSpotのParallelGC adaptiveサイズポリシーがベースになっています。HotSpotとの主な違いは、GraalVMがメモリフットプリントに重点を置いていることです。つまり、GraalVMの adaptive GCポリシーは、メモリ消費を抑えるために積極的にGCをトリガーしようとします。

source: Theme
ja_jp: テーマ

source: Theme (Change between Desktop/Light/Dark
ja_jp: テーマ (デスクトップ/ライト/ダーク間で変更)

source: Theme State
ja_jp: テーマの状態

source: Theme options available:
ja_jp: テーマのオプションが用意されています:

source: Then
ja_jp: この場合、

source: Then a Sampler Provider:
ja_jp: 次に Sampler Provider を作成できます。

source: Then a component test could look like:
ja_jp: この場合、コンポーネントテストは次のようになります。

source: Then activate on the configuration:
ja_jp: 次に、設定を有効にします。

source: Then add the relevant configuration properties in `{config-file}`.
ja_jp: 次に、 `{config-file}` で関連する設定プロパティを追加します。

source: Then add the relevant constraints to `Book`, assigning the right group to each constraint:
ja_jp: 次に、関連する制約を `Book` に追加し、各制約に適切なグループを割り当てます。

source: Then all that is required is a very simple `GeneratedSchema` interface with an annotation on it to specify configuration settings
ja_jp: 必要なのは、設定を指定する為のアノテーションを付与した非常にシンプルな `GeneratedSchema` インターフェイスだけです。

source: Then build your native executable as usual:
ja_jp: 次に、通常どおりネイティブ実行可能ファイルをビルドします。

source: Then change the `extends` to observe state:
ja_jp: 次に、状態を観察するために `extends` を変更します。

source: Then check that the endpoint returns `hello quarkus` as expected:
ja_jp: その後、エンドポイントが期待通りに `hello quarkus` を返すことを確認します。

source: Then click the `OK` button. The configuration will now appear on the top right side of the window:
ja_jp: 次に、 `OK` ボタンをクリックします。これで、ウィンドウの右上に構成が表示されます。

source: Then configure the database connection url. This step depends on the database type.
ja_jp: 次に、データベース接続の URL を設定します。この手順は、データベースのタイプによって異なります。

source: Then configure your application to log in JSON format
ja_jp: 次に、JSON 形式でログインするようにアプリケーションを設定します。

source: Then configure your datasource:
ja_jp: 次に、データソースを設定します。

source: Then configure your reactive datasource with no hostname and with the Netty native transport:
ja_jp: 次に、リアクティブデータソースをホスト名なし、Nettyネイティブトランスポートで設定します。

source: Then configure your reactive datasource:
ja_jp: 次に、リアクティブデータソースを構成します。

source: Then create a Cryostat CR resource instance to let the Operator know you'd like to deploy a Cryostat instance. At this stage you can also choose some configuration options, but we'll assume the defaults for now.
ja_jp: 次に、Cryostat CR リソースインスタンスを作成し、Operator に Cryostat インスタンスをデプロイすることを知らせます。この段階で、いくつかの設定オプションを選択することもできますが、ここではデフォルトを前提とします。

source: Then create a serializer and/or a deserializer for JSON-B, an example of which can be seen in the `mongodb-panache` extension.
ja_jp: 次に、JSON-B のシリアライザーまたはデシリアライザー、あるいはその両方を作成します。 `mongodb-panache` エクステンションでその例を確認できます。

source: Then create a serializer or a deserializer (or both) for Jackson, an example of which can be seen in the `mongodb-panache` extension.
ja_jp: 次に、Jackson 用のシリアライザまたはデシリアライザ (またはその両方) を作成します。 `mongodb-panache` のエクステンションで例を見ることができます。

source: Then create the component alongside your other Dev UI pages:
ja_jp: 次に、他の Dev UI ページと一緒にコンポーネントを作成します。

source: Then declare one `public static native TemplateInstance method();` per template file. Use those static methods to build your template instances:
ja_jp: そして、テンプレートファイルごとに `public static native TemplateInstance method();` を宣言します。これらの静的メソッドを使用してテンプレートインスタンスを構築します。

source: Then execute the following sequence:
ja_jp: そして、以下のシーケンスを実行します。

source: Then from another directory, use our tooling to create a new `greeting-app` Quarkus application with your new extension:
ja_jp: 次に、別のディレクトリから、我々のツールを使用して、新しいエクステンションを持つ新しい `greeting-app` Quarkus アプリケーションを作成します。

source: Then go back to the `gdb` shell and instruct it to continue the startup procedure after hitting the first instruction:
ja_jp: 次に、 `gdb` シェルに戻り、最初の命令を実行した後、起動手順を続行するように指示します。

source: Then in a _bean_, you can use the `@Route` annotation as follows:
ja_jp: そして、 _Bean_ では、以下のように `@Route` アノテーションを使用することができます。

source: Then it is just a matter of resolving the dependencies of the build steps to get to the final result: your application.
ja_jp: あとは、ビルドステップの依存関係を解決して、最終結果であるアプリケーションを完成させるだけです。

source: Then it receives a generated template like:
ja_jp: 次に、以下のような生成されたテンプレートを受け取ります。

source: Then launch it:
ja_jp: そして、それを起動します：

source: Then open your 2 browser windows to http://localhost:8080/:
ja_jp: そして、ブラウザウィンドウを2つ開いて、 http://localhost:8080/ に移動します:

source: Then press the `Login` button, and you will be logged in:
ja_jp: その後、 `Login` ボタンを押せば、ログイン状態になります:

source: Then process the stacks file as a flamegraph. Note that the stacks generated by this script are already collapsed, so the flamegraph can be generated just like this:
ja_jp: 次に、スタックファイルをフレームグラフとして処理します。 このスクリプトによって生成されたスタックはすでに折りたたまれていることに注意してください。 したがって、フレームグラフは次のように生成できます。

source: Then run it:
ja_jp: 次に、それを実行します:

source: Then run the application with:
ja_jp: その後、次のコマンドでアプリケーションを実行します。

source: Then scroll down to find the `Sign in with Apple` Capability, select it, and press `Continue`:
ja_jp: 次に、下にスクロールして `Sign in with Apple` 機能を見つけ、それを選択して、 `Continue` を押します。

source: Then start the application in `gdb` and execute `run`.
ja_jp: 続いて、 `gdb` でアプリケーションを起動し、 `run` を実行します。

source: Then start the live-coding *and navigate to http://0.0.0.0:8080/quinoa.html*:
ja_jp: そして、ライブコーディングを開始し、* http://0.0.0.0:8080/quinoa.html に移動*します。

source: Then the actual `PersonRepository` interface to be used would look like:
ja_jp: この場合、使用される実際の `PersonRepository` インターフェイスは次のようになります。

source: Then the file `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/TemperatureMeasurement.java`, representing temperature measurements for a given station:
ja_jp: 次に、指定されたステーションの温度測定値を表すファイル `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/TemperatureMeasurement.java` です。

source: Then the request-scoped bean can be accessed in the message processing stage, regardless of the <<execution_model>>:
ja_jp: すると、<<execution_model>> にかかわらず、メッセージ処理ステージでリクエストスコープの Bean にアクセスできます。

source: Then the service interface is `hello.Greeter` and the implementation base is the abstract static nested class: `hello.GreeterGrpc.GreeterImplBase`.
ja_jp: サービス・インターフェースは `hello.Greeter` であり、実装ベースは `hello.GreeterGrpc.GreeterImplBase` という抽象的な静的ネストクラスです。

source: Then the service interface name is: `hello.Greeter`, the Mutiny stub name is: `hello.MutinyGreeterGrpc.MutinyGreeterStub` and the blocking stub name is: `hello.GreeterGrpc.GreeterBlockingStub`.
ja_jp: サービスインターフェース名は `hello.Greeter` 、Mutiny stub名は `hello.MutinyGreeterGrpc.MutinyGreeterStub` 、Blocking stub名は `hello.GreeterGrpc.GreeterBlockingStub` となります。

source: Then try the following sequence and look for `example_list_size` in the plain text output:
ja_jp: 次に、以下のシーケンスを試して、プレーンテキストの出力で `example_list_size` を確認してください。

source: Then upgrade producers (they start writing v3 format)
ja_jp: 次に、プロデューサーをアップグレードします (v3 形式で書き込みを開始します)。

source: Then use `@QuarkusTestResource` to configure the Kafka Companion in tests, for example:
ja_jp: 次に、 `@QuarkusTestResource` を使用して、テストで Kafka Companion を設定します。以下に例を示します。

source: Then use the `BuildTimeActionBuildItem` and register assistant actions via `.addAssistantAction(...)`:
ja_jp: 次に `BuildTimeActionBuildItem` を使用し、 `.addAssistantAction(...)` を介してアシスタントアクションを登録します。

source: Then visit the http://localhost:16686[Jaeger UI] to see the tracing information.
ja_jp: その後、 link:http://localhost:16686[Jaeger UI] にアクセスしてトレース情報を確認します。

source: Then we can define how to read and write it with our body reader/writers, annotated with link:{jaxrsapi}/jakarta/ws/rs/ext/Provider.html[`@Provider`]:
ja_jp: 次に、 link:{jaxrsapi}/javax/ws/rs/ext/Provider.html[`@Provider`] でアノテーションを付けたボディリーダー/ライターを使用して読み取りと書き込みの方法を定義できます。

source: Then we can define how to read and write it with our body reader/writers, annotated with link:{jaxrsapi}/javax/ws/rs/ext/Provider.html[`@Provider`]:
ja_jp: 次に、 link:{jaxrsapi}/javax/ws/rs/ext/Provider.html[`@Provider`] でアノテーションを付けたボディリーダー/ライターを使用して読み取りと書き込みの方法を定義できます:

source: Then we executed several runs with different configurations (`plain Java 180 Mb`, `Quarkus native 180 Mb`, `Quarkus jvm 180 Mb`, `Quarkus native 50 Mb` , starting from `50 millicores request=limit`, moving up to `100`, `150`, …
ja_jp: そして、さまざまな構成（ `plain Java 180 Mb` 、 `Quarkus native 180 Mb` 、 `Quarkus jvm 180 Mb` 、 `Quarkus native 50 Mb` 、 `50 millicores request=limit` から始めて、 `100` 、 `150` 、 ...）で数回の実行を行いました。

source: Then we need to give a read capability to the Quarkus application on path `rabbitmq/creds/my-role`.
ja_jp: 次に、パス `rabbitmq/creds/my-role` で Quarkus アプリケーションに読み取り機能を与える必要があります。

source: Then with dev mode you can edit that file and save it again and Quarkus live reload feature will take care of applying the changes.
ja_jp: その後、開発モードでファイルを編集して再度保存すると、Quarkusのライブリロード機能が変更の適用の世話をしてくれます。

source: Then you can call your background function via an HTTP call with a payload containing the event:
ja_jp: 起動後、HTTP 呼び出しにイベントを含むペイロードを付与することでバックグラウンド関数を呼び出すことができます。

source: Then you can call your cloud events function via an HTTP call with a payload containing the event:
ja_jp: イベントを含むペイロードを持つHTTPコールを介して、CloudEventsFunctionを呼び出すことができます。

source: Then you can create the ACR:
ja_jp: そうすれば、ACRを作成することができます。

source: Then you can import your new extension into your favorite IDE.
ja_jp: その後、お好きなIDEに新しいエクステンションをインポートすることができます。

source: Then you can inject the `Assistant` like this:
ja_jp: その後、次のように `Assistant` を注入できます。

source: Then you can look for direct calls at depth of 2, so you’d search for methods that call methods that call into the target method:
ja_jp: そうすれば、深さ2の直接呼び出しを探すことができます。つまり、対象のメソッドを呼び出すメソッドを呼び出すメソッドを探すことになります。

source: Then you can loop over the pages and build the links/buttons. To actions the navigation your use the go method
ja_jp: その後、ページをループしてリンク/ボタンを構築できます。ナビゲーションを実行するには `go` メソッドを使用します

source: Then you can start using the annotation `@RunOnVirtualThread` in your service implementation:
ja_jp: これで、サービス実装で `@RunOnVirtualThread` アノテーションを使用できるようになりました。

source: Then you can start using the annotation `@RunOnVirtualThread` on your consumer methods also annotated with `@Incoming`. In the following example we'll use the xref:rest-client.adoc[REST Client] to make a blocking call to a REST endpoint:
ja_jp: その後、 `@Incoming` アノテーションが付けられたコンシューマーメソッドで、アノテーション `@RunOnVirtualThread` を使い始めることができます。 次の例では、xref:rest-client.adoc[REST クライアント] を使用して、REST エンドポイントへのブロッキング呼び出しを行います。

source: Then you can use it to launch your function locally, again, the command depends on the type of function and the type of events.
ja_jp: その後、これは、ローカルで関数を起動するために使用することができます。このコマンドは、関数の種類とイベントの種類に依存します。

source: Then you can use it to launch your function locally.
ja_jp: そして、それを使ってローカルに機能を立ち上げることができます。

source: Then you can use the `OidcClient.refreshTokens` method with a provided refresh token to get the access token.
ja_jp: 次に、 `OidcClient.refreshTokens` メソッドと提供されたリフレッシュトークンを使用して、アクセストークンを取得できます。

source: Then you could obtain all the various parameters with this endpoint method:
ja_jp: 次に、このエンドポイントメソッドを使用してさまざまなパラメーターをすべて取得できます。
